## Data cleaning and Preparation

In [280]:
import pandas as pd

Loading the students data from the CSV file into a DataFrame for ease of data cleaning and processing

In [283]:
Students = pd.read_csv("students.csv")
Students

   Student_ID         Name  Age  Gender   Location Enrolment_Date
0        S001    Student_1   24  Female    Kolkata     24/11/2023
1        S002    Student_2   32   Other    Chennai     27/02/2023
2        S003    Student_3   28   Other     Mumbai     13/01/2023
3        S004    Student_4   25  Female  Bangalore     21/05/2023
4        S005    Student_5   24   Other      Delhi     06/05/2023
..        ...          ...  ...     ...        ...            ...
95       S096   Student_96   32   Other    Chennai     19/12/2023
96       S097   Student_97   31   Other    Chennai     13/10/2023
97       S098   Student_98   20   Other    Kolkata     23/04/2023
98       S099   Student_99   18    Male    Kolkata     17/12/2023
99       S100  Student_100   22   Other  Bangalore     16/06/2023

[100 rows x 6 columns]

Using `Students.info()` to inspect the dataset. This helps verify that each column has the appropriate data type, identify the number of rows and columns, and check for any null values.

In [286]:
Students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Student_ID      100 non-null    object
 1   Name            100 non-null    object
 2   Age             100 non-null    int64
 3   Gender          100 non-null    object
 4   Location        100 non-null    object
 5   Enrolment_Date  100 non-null    object
dtypes: int64(1), object(5)
memory usage: 4.8+ KB

As observed in the previous step, the `Enrolment_Date` column is of object data type. We are now converting it to datetime format to enable proper date-based operations and analysis.

In [289]:
Students['Enrolment_Date'] = pd.to_datetime(Students['Enrolment_Date'], dayfirst=True)
Students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Student_ID      100 non-null    object
 1   Name            100 non-null    object
 2   Age             100 non-null    int64
 3   Gender          100 non-null    object
 4   Location        100 non-null    object
 5   Enrolment_Date  100 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 4.8+ KB

Checking for null values

In [292]:
Students.isnull().sum()

Student_ID        0
Name              0
Age               0
Gender            0
Location          0
Enrolment_Date    0
dtype: int64

Checking if there is any duplicated values in this dataset

In [295]:
Students.duplicated().sum()

0

Since there are no null or duplicate values in the dataset, no further data cleaning is required. We can now proceed to the next dataset.

In [298]:
Students

   Student_ID         Name  Age  Gender   Location Enrolment_Date
0        S001    Student_1   24  Female    Kolkata     2023-11-24
1        S002    Student_2   32   Other    Chennai     2023-02-27
2        S003    Student_3   28   Other     Mumbai     2023-01-13
3        S004    Student_4   25  Female  Bangalore     2023-05-21
4        S005    Student_5   24   Other      Delhi     2023-05-06
..        ...          ...  ...     ...        ...            ...
95       S096   Student_96   32   Other    Chennai     2023-12-19
96       S097   Student_97   31   Other    Chennai     2023-10-13
97       S098   Student_98   20   Other    Kolkata     2023-04-23
98       S099   Student_99   18    Male    Kolkata     2023-12-17
99       S100  Student_100   22   Other  Bangalore     2023-06-16

[100 rows x 6 columns]

Loading the `Course_activity` data from the CSV file into a DataFrame for ease of data cleaning and processing

In [301]:
Course_activity = pd.read_csv("course_activity.csv")
Course_activity

,Student_ID,Course_ID,Date,Time_Spent_Minutes,Completion_Percentage
0,S001,PY202,05/01/2024,90,46.10
1,S001,DM101,28/01/2024,155,88.87
2,S001,UX303,28/01/2024,177,54.93
3,S002,PY202,03/02/2024,45,32.20
4,S002,UX303,15/03/2024,119,90.80
...,...,...,...,...,...
654,S100,PY202,03/03/2024,83,22.63
655,S100,UX303,27/02/2024,168,14.83
656,S100,UX303,02/01/2024,134,22.29
657,S100,WD404,12/03/2024,139,68.78
658,S100,WD404,28/03/2024,135,47.41

Using `Course_activity.info()` to inspect the dataset. This helps verify that each column has the appropriate data type, identify the number of rows and columns, and check for any null values.

In [304]:
Course_activity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 659 entries, 0 to 658
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Student_ID             659 non-null    object
 1   Course_ID              659 non-null    object
 2   Date                   659 non-null    object
 3   Time_Spent_Minutes     659 non-null    int64
 4   Completion_Percentage  659 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 25.9+ KB

As observed in the previous step, the `Date` column is of object data type. We are now converting it to datetime format to enable proper date-based operations and analysis.

In [307]:
Course_activity['Date'] = pd.to_datetime(Course_activity['Date'], dayfirst=True)
Course_activity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 659 entries, 0 to 658
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Student_ID             659 non-null    object
 1   Course_ID              659 non-null    object
 2   Date                   659 non-null    datetime64[ns]
 3   Time_Spent_Minutes     659 non-null    int64
 4   Completion_Percentage  659 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 25.9+ KB

Checking for null values

In [310]:
Course_activity.isnull().sum()

Student_ID               0
Course_ID                0
Date                     0
Time_Spent_Minutes       0
Completion_Percentage    0
dtype: int64

Checking for duplicate values in the dataset

In [313]:
Course_activity.duplicated().sum()

0

Since there are no null or duplicate values in the dataset, no further data cleaning is required. We can now proceed to the next dataset.

In [316]:
Course_activity

    Student_ID Course_ID       Date  Time_Spent_Minutes  Completion_Percentage
0         S001     PY202 2024-01-05                  90                  46.10
1         S001     DM101 2024-01-28                 155                  88.87
2         S001     UX303 2024-01-28                 177                  54.93
3         S002     PY202 2024-02-03                  45                  32.20
4         S002     UX303 2024-03-15                 119                  90.80
..         ...       ...        ...                 ...                    ...
654       S100     PY202 2024-03-03                  83                  22.63
655       S100     UX303 2024-02-27                 168                  14.83
656       S100     UX303 2024-01-02                 134                  22.29
657       S100     WD404 2024-03-12                 139                  68.78
658       S100     WD404 2024-03-28                 135                  47.41

[659 rows x 5 columns]

Loading the Feedback data from the CSV file into a DataFrame for ease of data cleaning and processing

In [319]:
Feedback = pd.read_csv('feedback.csv')
Feedback

   Student_ID Course_ID  Rating         Feedback_Text
0        S057     UX303       2        Too fast-paced
1        S063     PY202       2    Loved the examples
2        S022     PY202       4       Could be better
3        S011     PY202       5     Needs improvement
4        S073     WD404       4       Could be better
..        ...       ...     ...                   ...
75       S087     DM101       1       Well structured
76       S065     DM101       4    Loved the examples
77       S082     WD404       2        Too fast-paced
78       S067     DM101       5  Excellent instructor
79       S002     PY202       3       Well structured

[80 rows x 4 columns]

Using `Feedback.info()` to inspect the dataset. This helps verify that each column has the appropriate data type, identify the number of rows and columns, and check for any null values.

In [322]:
Feedback.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student_ID     80 non-null     object
 1   Course_ID      80 non-null     object
 2   Rating         80 non-null     int64
 3   Feedback_Text  80 non-null     object
dtypes: int64(1), object(3)
memory usage: 2.6+ KB

checking for null values

In [325]:
Feedback.isnull().sum()

Student_ID       0
Course_ID        0
Rating           0
Feedback_Text    0
dtype: int64

Checking for duplicate values in the feedback dataset

In [328]:
Feedback.duplicated().sum()

0

No duplicate or null values found

## Exploratory Data Analysis

### •	What is the overall average completion rate across courses?

The information on the completion percenatge exists in the Course_activity data

In [334]:
avg_completion = Course_activity['Completion_Percentage'].mean()
print(f"The overall average completion rate across all courses is {avg_completion:.2f}%")

The overall average completion rate across all courses is 54.78%

Let's also check the Completion rate per course

In [337]:
avg_course = Course_activity.groupby('Course_ID')['Completion_Percentage'].mean().round(2)
print("The average completion rate per course is as follows:\n ", avg_course)

The average completion rate per course is as follows:
  Course_ID
DM101    52.62
PY202    56.10
UX303    56.16
WD404    54.14
Name: Completion_Percentage, dtype: float64

### •	Which course has the highest and lowest average engagement time?

To identify the courses with the highest and lowest average engagement time, we use the `Course_Activity` DataFrame. By applying the `min()` and `max()` functions on the average engagement data, we can determine the courses with the least and most engagement.

Grouping the data by course enables aggregate operations—such as `mean()`—to be performed on each group for meaningful insight.

In [341]:
Engagement = Course_activity.groupby('Course_ID')['Time_Spent_Minutes'].mean().round(2)

max_course = Engagement.idxmax()
max_value = Engagement.max()

min_course = Engagement.idxmin()
min_value = Engagement.min()

print(f" Course which has the highest average engagement time is {max_course} with {max_value} minutes")
print(f" Course whcih has the lowest average engagement time is {min_course} with {min_value} minutes")

 Course which has the highest average engagement time is DM101 with 102.43 minutes
 Course whcih has the lowest average engagement time is PY202 with 93.9 minutes

### •	How does engagement differ by age group or location?

We begin by categorizing users into three age groups: young adults, mid-20s to late-20s, and early 30s.  
Next, we calculate the average time spent and average course completion percentage for each age group to analyze engagement patterns

In [345]:
def category(age):
    if 18 <= age <= 23:
        return '18-23'
    elif 24 <= age <= 29:
        return '24-29'
    elif 30 <= age <= 34:
        return '30-34'
    else:
        return 'Other'

Students['Age_Group'] = Students['Age'].apply(category)

Merged_Table = pd.merge(Course_activity, Students, on='Student_ID')

engagement_by_age = Merged_Table.groupby('Age_Group').agg(
    Average_Time_Spent=('Time_Spent_Minutes', 'mean'),
    Avg_Completion_Percentage=('Completion_Percentage', 'mean'),
     Students_Count=('Student_ID', 'nunique')
).reset_index().sort_values('Age_Group')

engagement_by_age[['Average_Time_Spent', 'Avg_Completion_Percentage']] = engagement_by_age[['Average_Time_Spent', 'Avg_Completion_Percentage']].round(2)

engagement_by_age

  Age_Group  Average_Time_Spent  Avg_Completion_Percentage  Students_Count
0     18-23              101.68                      53.35              35
1     24-29               96.75                      54.80              41
2     30-34               95.53                      56.71              24

Now, we are Calculating the average time spent and average course completion percentage for each location to analyze engagement patterns

In [348]:
engagement_by_location = Merged_Table.groupby('Location').agg(
    Avg_Time_Spent=('Time_Spent_Minutes', 'mean'),
    Avg_Completion_Percentage=('Completion_Percentage', 'mean'),
    Students_Count=('Student_ID', 'nunique')
).reset_index().sort_values('Location')

engagement_by_location[['Avg_Time_Spent', 'Avg_Completion_Percentage']] = engagement_by_location[['Avg_Time_Spent', 'Avg_Completion_Percentage']].round(2)

engagement_by_location

    Location  Avg_Time_Spent  Avg_Completion_Percentage  Students_Count
0  Bangalore           98.00                      53.12              26
1    Chennai           90.95                      53.60              25
2      Delhi          103.30                      55.78              25
3    Kolkata          104.38                      56.36              13
4     Mumbai           95.44                      57.85              11

In [350]:
engagement_by_age['Average_completion_efficiency'] = (
    engagement_by_age['Avg_Completion_Percentage'] / engagement_by_age['Average_Time_Spent']*100).round(2)

Since the average time spent and average completion percentage alone do not provide enough insight into how engagement differs by age group, we will also compute:
- `Avg_Completion_Efficiency`: a metric to evaluate how efficiently students complete the course.
- `Engagement_Score`: a combined metric to better understand overall engagement.

These additional calculations will help in forming a more comprehensive understanding of engagement by age grup.

In [353]:
from sklearn.preprocessing import MinMaxScaler

df = engagement_by_age.copy()

scaler = MinMaxScaler()
df[['Normalized_Time', 'Normalized_Completion']] = scaler.fit_transform(
    df[['Average_Time_Spent', 'Avg_Completion_Percentage']])

df['Engagement_Score'] = ((df['Normalized_Time'] + df['Normalized_Completion']) / 2).round(2)

df[['Age_Group', 'Average_Time_Spent', 'Avg_Completion_Percentage',
    'Average_completion_efficiency', 'Engagement_Score']]

,Age_Group,Average_Time_Spent,Avg_Completion_Percentage,Average_completion_efficiency,Engagement_Score
0,18-23,101.68,53.35,52.47,0.50
1,24-29,96.75,54.80,56.64,0.31
2,30-34,95.53,56.71,59.36,0.50

##### Since 2 age groups has the same engagemnet score, let's consider the Average completion efficiency percentage as well to arrive at a better conclusion. The 30–34 age group demonstrates the highest quality engagement — they are not just participating more, but doing so more effectively. The 18–23 group is also quite engaged but less efficient, while the 24–29 group, though less engaged, makes better use of their time than the youngest group.

In [356]:
engagement_by_location['Average_completion_efficiency'] = (
    engagement_by_location['Avg_Completion_Percentage'] / engagement_by_location['Avg_Time_Spent']*100).round(2)

Since the average time spent and average completion percentage alone do not provide enough insight into how engagement differs by location, we will also compute:
- `Avg_Completion_Efficiency`: a metric to evaluate how efficiently students complete the course.
- `Engagement_Score`: a combined metric to better understand overall engagement.

These additional calculations will help in forming a more comprehensive understanding of engagementlocationrup.

In [359]:
df1 = engagement_by_location.copy()

scaler = MinMaxScaler()
df1[['Normalized_Time', 'Normalized_Completion']] = scaler.fit_transform(
    df1[['Avg_Time_Spent', 'Avg_Completion_Percentage']])

df1['Engagement_Score'] = ((df1['Normalized_Time'] + df1['Normalized_Completion']) / 2).round(2)

df1[['Location', 'Avg_Time_Spent', 'Avg_Completion_Percentage',
    'Average_completion_efficiency', 'Engagement_Score']]

,Location,Avg_Time_Spent,Avg_Completion_Percentage,Average_completion_efficiency,Engagement_Score
0,Bangalore,98.00,53.12,54.20,0.26
1,Chennai,90.95,53.60,58.93,0.05
2,Delhi,103.30,55.78,54.00,0.74
3,Kolkata,104.38,56.36,54.00,0.84
4,Mumbai,95.44,57.85,60.61,0.67

##### Kolkata has the highest engagement score, which means people there are the most active. Delhi and Mumbai also have good engagement, but not as high as Kolkata. People in Bangalore are less engaged, and Chennai has the lowest engagement score. This shows that users in Kolkata, Delhi, and Mumbai are more involved, while users in Bangalore and Chennai are less active.

### •	What is the average feedback rating per course?

This line groups the data by one or more keys, allowing aggregate operations like sum, mean, etc., on each group.

In [364]:
Course_rating = Feedback.groupby('Course_ID')[['Rating']].mean().round(2).reset_index()
Course_rating.rename(columns={'Rating': 'Average_Rating'}, inplace=True)
Course_rating

  Course_ID  Average_Rating
0     DM101            2.90
1     PY202            3.28
2     UX303            2.92
3     WD404            2.79

### •	Is there a correlation between completion rate and feedback rating?

Since the completion rate is available in the `Course_Activity` table and the feedback rating data exists in the `Feedback` table, we will first merge these two tables to consolidate the necessary information for analysis.

In [368]:
Merged_Table1 = pd.merge(Course_activity, Feedback, on=['Course_ID', 'Student_ID'])

In [370]:
Merged_Table1

,Student_ID,Course_ID,Date,Time_Spent_Minutes,Completion_Percentage,Rating,Feedback_Text
0,S002,PY202,2024-02-03,45,32.20,3,Well structured
1,S002,PY202,2024-03-06,136,18.18,3,Well structured
2,S005,DM101,2024-01-30,27,91.49,4,Loved the examples
3,S006,DM101,2024-03-27,177,98.57,1,Loved the examples
4,S006,DM101,2024-01-08,113,75.54,1,Loved the examples
...,...,...,...,...,...,...,...
117,S095,DM101,2024-02-26,125,38.70,3,Too fast-paced
118,S097,PY202,2024-01-27,81,77.71,5,Loved the examples
119,S097,PY202,2024-02-16,93,27.74,5,Loved the examples
120,S099,WD404,2024-02-23,162,22.41,5,Needs improvement
121,S099,WD404,2024-02-24,57,53.80,5,Needs improvement

In [372]:
from scipy.stats import pearsonr

Correlation_coef, p_value = pearsonr(Merged_Table1['Completion_Percentage'], Merged_Table1['Rating'])
print(f"Pearson Correlation Coefficient: {Correlation_coef:.3f}")
print(f"P-value: {p_value:.3e}")

if p_value < 0.05:
    print("Yes, There is a statistically significant correlation between Completion rate and Feedback rating")
else:
    print("No statistically significant correlation found between Completion rate and Feedback rating")

Pearson Correlation Coefficient: -0.052
P-value: 5.716e-01
No statistically significant correlation found between Completion rate and Feedback rating

### •	Identify top 3 student segments based on engagement and satisfaction.

We begin by categorizing students into age groups (18–23, 24–29, 30–34, and Other), merging the `Course_activity`, `Students`, and `Feedback` tables, and grouping by `Age_Group`, `Gender`, and—if present—`Education_Level`.  
Next, we calculate each segment’s average time spent, completion percentage, and feedback rating, filter out segments with fewer than five students, normalize these metrics via MinMax scaling, compute an overall engagement-satisfaction score, and select the top three segments

In [376]:
def category(age):
    if 18 <= age <= 23:
        return '18-23'
    elif 24 <= age <= 29:
        return '24-29'
    elif 30 <= age <= 34:
        return '30-34'
    else:
        return 'Other'

Students['Age_Group'] = Students['Age'].apply(category)

merged = pd.merge(Course_activity, Students, on='Student_ID')
merged = pd.merge(merged, Feedback, on=['Student_ID', 'Course_ID'])

segment_columns = ['Age_Group', 'Gender']
if 'Education_Level' in Students.columns:
    segment_columns.append('Education_Level')

segment_stats = merged.groupby(segment_columns).agg(
    Avg_Time_Spent=('Time_Spent_Minutes', 'mean'),
    Avg_Completion_Percentage=('Completion_Percentage', 'mean'),
    Avg_Rating=('Rating', 'mean'),
    Student_Count=('Student_ID', 'count')
).reset_index()

segment_stats = segment_stats[segment_stats['Student_Count'] >= 5]

scaler = MinMaxScaler()
normed = scaler.fit_transform(segment_stats[['Avg_Time_Spent', 'Avg_Completion_Percentage', 'Avg_Rating']])
segment_stats[['Norm_Time', 'Norm_Completion', 'Norm_Rating']] = normed

segment_stats['Engagement_Satisfaction_Score'] = segment_stats[['Norm_Time', 'Norm_Completion', 'Norm_Rating']].mean(axis=1)

top_segments = segment_stats.sort_values('Engagement_Satisfaction_Score', ascending=False).head(3)

print("Top 3 Student Segments Based on Engagement and Satisfaction:")
display(top_segments[segment_columns + [
    'Avg_Time_Spent', 'Avg_Completion_Percentage', 'Avg_Rating', 'Engagement_Satisfaction_Score'
]].round(2))

Top 3 Student Segments Based on Engagement and Satisfaction:

,Age_Group,Gender,Avg_Time_Spent,Avg_Completion_Percentage,Avg_Rating,Engagement_Satisfaction_Score
6,30-34,Female,111.27,66.98,3.00,0.78
3,24-29,Female,117.35,61.55,2.59,0.69
2,18-23,Other,104.40,57.93,3.80,0.68